# GetPerformanceAdviser Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..GetPerformanceAdviser Method
PerformanceAdviser Class See Also
---
Returns the only instance of PerformanceAdviser in the Application.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static PerformanceAdviser GetPerformanceAdviser()
```

Visual Basic
---
```text
Public Shared Function GetPerformanceAdviser As PerformanceAdviser
```

Visual C++
---
```text
public:
static PerformanceAdviser^ GetPerformanceAdviser()
```

# ### Return Value
The only instance of PerformanceAdviser in the Application.
# See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace